Autodesk.Revit.DB.Structure.RebarTrimExtendData.CreateEndConstraint(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
Creates a constraint for the end handle of the rebar. This constraint will be set preferred after the API execution is finished successfully.
targetReferences:
The references to which the rebar handle will be constrained.
Will throw exception if it's empty or if it's anything but Face(s) from a structural that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Returns:
Returns true if a start constraint can be created with the given references, false otherwise.
The reference should be faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.CreateStartConstraint(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
Creates a constraint for the start handle of the rebar. This constraint will be set preferred after the API execution is finished successfully.
targetReferences:
The references to which the rebar handle will be constrained.
Will throw exception if it's empty or if it's anything but Face(s) from a structural that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Returns:
Returns true if a start constraint can be created with the given references, false otherwise.
The reference should be faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.AddBarGeometry(Autodesk.Revit.DB.CurveLoop)
Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This function can fail due to following reasons:
CurveLoop is empty.
CurveLoop contains an unbounded curve.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Curves describing one bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Incorrect number of bar geometry.
Since:
2018

Autodesk.Revit.DB.Structure.RebarTrimExtendData.AddBarGeometry(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This function will can fail due to following reasons:
One or more of the input curves was null.
One or more of the input curves was unbounded.
Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Curves describing one bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Incorrect number of bar geometry.
Since:
2018